In [13]:
import pandas as pd

In [14]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes': 8, 'suits': 45},
         {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5, 'shirts': 2, 'shoes': 5, 'suits': 7},
         {'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes': 10}]

store_items = pd.DataFrame(items)
store_items

   bikes  glasses  pants  shirts  shoes  suits  watches
0     20      NaN     30    15.0      8   45.0       35
1     15     50.0      5     2.0      5    7.0       10
2     20      4.0     30     NaN     10    NaN       35

In [15]:
nan_values = store_items.isnull()
print(nan_values)
nan_values = store_items.isnull().sum()
print('\n', nan_values)
nan_values = store_items.isnull().sum().sum()
print('\n', nan_values)

   bikes  glasses  pants  shirts  shoes  suits  watches
0  False     True  False   False  False  False    False
1  False    False  False   False  False  False    False
2  False    False  False    True  False   True    False

 bikes      0
glasses    1
pants      0
shirts     1
shoes      0
suits      1
watches    0
dtype: int64

 3

In [16]:
store_items.count()

bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

In [17]:
store_items.count().sum()

18

In [18]:
store_items.size # total of NaN plus not-NaN

21

In [19]:
store_items.dropna(axis=0) # eliminates all rows with NaN values

   bikes  glasses  pants  shirts  shoes  suits  watches
1     15     50.0      5     2.0      5    7.0       10

In [20]:
store_items.dropna(axis=1) # eliminates all columns with NaN values

   bikes  pants  shoes  watches
0     20     30      8       35
1     15      5      5       10
2     20     30     10       35

In [21]:
store_items.fillna(0) # replace NaN values with 0

   bikes  glasses  pants  shirts  shoes  suits  watches
0     20      0.0     30    15.0      8   45.0       35
1     15     50.0      5     2.0      5    7.0       10
2     20      4.0     30     0.0     10    0.0       35

In [22]:
store_items

   bikes  glasses  pants  shirts  shoes  suits  watches
0     20      NaN     30    15.0      8   45.0       35
1     15     50.0      5     2.0      5    7.0       10
2     20      4.0     30     NaN     10    NaN       35

In [23]:
store_items.fillna(method='ffill', axis=0) # forward fill method uses value from previous row

   bikes  glasses  pants  shirts  shoes  suits  watches
0     20      NaN     30    15.0      8   45.0       35
1     15     50.0      5     2.0      5    7.0       10
2     20      4.0     30     2.0     10    7.0       35

**Notice that the NaN value in row 0 did not get replace, because there is no earlier row to get values from**

In [24]:
store_items.fillna(method='ffill', axis=1) # forward fill method uses value from previous column

   bikes  glasses  pants  shirts  shoes  suits  watches
0   20.0     20.0   30.0    15.0    8.0   45.0     35.0
1   15.0     50.0    5.0     2.0    5.0    7.0     10.0
2   20.0      4.0   30.0    30.0   10.0   10.0     35.0

In [25]:
store_items.fillna(method='backfill', axis=0) # forward fill method uses value from next row

   bikes  glasses  pants  shirts  shoes  suits  watches
0     20     50.0     30    15.0      8   45.0       35
1     15     50.0      5     2.0      5    7.0       10
2     20      4.0     30     NaN     10    NaN       35

In [26]:
store_items.fillna(method='backfill', axis=1) # forward fill method uses value from next column

   bikes  glasses  pants  shirts  shoes  suits  watches
0   20.0     30.0   30.0    15.0    8.0   45.0     35.0
1   15.0     50.0    5.0     2.0    5.0    7.0     10.0
2   20.0      4.0   30.0    10.0   10.0   35.0     35.0